Repository: kbiggers/python-docs-es
Catalog: deprecations/index.po
Languages: es

source: Deprecations
es: Desusos

source: Pending Removal in Python 3.14
es: Eliminación pendiente en Python 3.14

source: :mod:`argparse`: The *type*, *choices*, and *metavar* parameters of :class:`!argparse.BooleanOptionalAction` are deprecated and will be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`92248`.)
es: :mod:`argparse`: Los parámetros *type*, *choices* y *metavar* de :class:`!argparse.BooleanOptionalAction` están obsoletos y se eliminarán en la versión 3.14. (Contribuido por Nikita Sobolev en :gh:`92248`.)

source: :mod:`ast`: The following features have been deprecated in documentation since Python 3.8, now cause a :exc:`DeprecationWarning` to be emitted at runtime when they are accessed or used, and will be removed in Python 3.14:
es: :mod:`ast`: Las siguientes funciones han quedado obsoletas en la documentación desde Python 3.8, ahora hacen que se emita un :exc:`DeprecationWarning` en tiempo de ejecución cuando se accede a ellas o se las utiliza, y se eliminarán en Python 3.14:

source: Use :class:`ast.Constant` instead. (Contributed by Serhiy Storchaka in :gh:`90953`.)
es: Utilice :class:`ast.Constant` en su lugar. (Contribuido por Serhiy Storchaka en :gh:`90953`.)

source: The child watcher classes :class:`~asyncio.MultiLoopChildWatcher`, :class:`~asyncio.FastChildWatcher`, :class:`~asyncio.AbstractChildWatcher` and :class:`~asyncio.SafeChildWatcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
es: Las clases de supervisión secundaria :class:`~asyncio.MultiLoopChildWatcher`, :class:`~asyncio.FastChildWatcher`, :class:`~asyncio.AbstractChildWatcher` y :class:`~asyncio.SafeChildWatcher` están obsoletas y se eliminarán en Python 3.14. (Contribuido por Kumar Aditya en :gh:`94597`.)

source: :func:`asyncio.set_child_watcher`, :func:`asyncio.get_child_watcher`, :meth:`asyncio.AbstractEventLoopPolicy.set_child_watcher` and :meth:`asyncio.AbstractEventLoopPolicy.get_child_watcher` are deprecated and will be removed in Python 3.14. (Contributed by Kumar Aditya in :gh:`94597`.)
es: :func:`asyncio.set_child_watcher`, :func:`asyncio.get_child_watcher`, :meth:`asyncio.AbstractEventLoopPolicy.set_child_watcher` y :meth:`asyncio.AbstractEventLoopPolicy.get_child_watcher` están obsoletos y se eliminarán en Python 3.14. (Contribuido por Kumar Aditya en :gh:`94597`.)

source: The :meth:`~asyncio.get_event_loop` method of the default event loop policy now emits a :exc:`DeprecationWarning` if there is no current event loop set and it decides to create one. (Contributed by Serhiy Storchaka and Guido van Rossum in :gh:`100160`.)
es: El método :meth:`~asyncio.get_event_loop` de la política de bucle de eventos predeterminada ahora emite un :exc:`DeprecationWarning` si no hay ningún bucle de eventos definido actualmente y decide crear uno. (Contribuido por Serhiy Storchaka y Guido van Rossum en :gh:`100160`.)

source: :mod:`collections.abc`: Deprecated :class:`~collections.abc.ByteString`. Prefer :class:`!Sequence` or :class:`~collections.abc.Buffer`. For use in typing, prefer a union, like ``bytes | bytearray``, or :class:`collections.abc.Buffer`. (Contributed by Shantanu Jain in :gh:`91896`.)
es: :mod:`collections.abc`: :class:`~collections.abc.ByteString` obsoleto. Se prefiere :class:`!Sequence` o :class:`~collections.abc.Buffer`. Para uso en tipificación, se prefiere una unión, como ``bytes | bytearray`` o :class:`collections.abc.Buffer`. (Contribuido por Shantanu Jain en :gh:`91896`.)

source: :mod:`email`: Deprecated the *isdst* parameter in :func:`email.utils.localtime`. (Contributed by Alan Williams in :gh:`72346`.)
es: :mod:`email`: Se ha descontinuado el parámetro *isdst* en :func:`email.utils.localtime`. (Contribuido por Alan Williams en :gh:`72346`.)

source: :mod:`importlib.abc` deprecated classes:
es: Clases obsoletas de :mod:`importlib.abc`:

source: Use :mod:`importlib.resources.abc` classes instead:
es: Utilice clases :mod:`importlib.resources.abc` en su lugar:

source: (Contributed by Jason R. Coombs and Hugo van Kemenade in :gh:`93963`.)
es: (Contribuido por Jason R. Coombs y Hugo van Kemenade en :gh:`93963`.)

source: :mod:`itertools` had undocumented, inefficient, historically buggy, and inconsistent support for copy, deepcopy, and pickle operations. This will be removed in 3.14 for a significant reduction in code volume and maintenance burden. (Contributed by Raymond Hettinger in :gh:`101588`.)
es: :mod:`itertools` tenía un soporte indocumentado, ineficiente, históricamente lleno de errores e inconsistente para operaciones de copia, copia profunda y pickle. Esto se eliminará en la versión 3.14 para lograr una reducción significativa en el volumen de código y la carga de mantenimiento. (Contribuido por Raymond Hettinger en :gh:`101588`.)

source: :mod:`multiprocessing`: The default start method will change to a safer one on Linux, BSDs, and other non-macOS POSIX platforms where ``'fork'`` is currently the default (:gh:`84559`). Adding a runtime warning about this was deemed too disruptive as the majority of code is not expected to care. Use the :func:`~multiprocessing.get_context` or :func:`~multiprocessing.set_start_method` APIs to explicitly specify when your code *requires* ``'fork'``. See :ref:`multiprocessing-start-methods`.
es: :mod:`multiprocessing`: El método de inicio predeterminado cambiará a uno más seguro en Linux, BSD y otras plataformas POSIX que no sean macOS donde ``'fork'`` es actualmente el predeterminado (:gh:`84559`). Agregar una advertencia de tiempo de ejecución sobre esto se consideró demasiado disruptivo ya que no se espera que la mayoría del código tenga en cuenta esto. Use las API :func:`~multiprocessing.get_context` o :func:`~multiprocessing.set_start_method` para especificar explícitamente cuándo su código *requires* ``'fork'``. Consulte :ref:`multiprocessing-start-methods`.

source: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` and :meth:`~pathlib.PurePath.relative_to`: passing additional arguments is deprecated.
es: :mod:`pathlib`: :meth:`~pathlib.PurePath.is_relative_to` y :meth:`~pathlib.PurePath.relative_to`: pasar argumentos adicionales está obsoleto.

source: :mod:`pkgutil`: :func:`~pkgutil.find_loader` and :func:`~pkgutil.get_loader` now raise :exc:`DeprecationWarning`; use :func:`importlib.util.find_spec` instead. (Contributed by Nikita Sobolev in :gh:`97850`.)
es: :mod:`pkgutil`: :func:`~pkgutil.find_loader` y :func:`~pkgutil.get_loader` ahora generan :exc:`DeprecationWarning`; utilice :func:`importlib.util.find_spec` en su lugar. (Contribuido por Nikita Sobolev en :gh:`97850`.)

source: ``master_open()``: use :func:`pty.openpty`.
es: ``master_open()``: utilice :func:`pty.openpty`.

source: ``slave_open()``: use :func:`pty.openpty`.
es: ``slave_open()``: utilice :func:`pty.openpty`.

source: :data:`~sqlite3.version` and :data:`~sqlite3.version_info`.
es: :data:`~sqlite3.version` y :data:`~sqlite3.version_info`.

source: :meth:`~sqlite3.Cursor.execute` and :meth:`~sqlite3.Cursor.executemany` if :ref:`named placeholders <sqlite3-placeholders>` are used and *parameters* is a sequence instead of a :class:`dict`.
es: :meth:`~sqlite3.Cursor.execute` y :meth:`~sqlite3.Cursor.executemany` si se utilizan :ref:`named placeholders <sqlite3-placeholders>` y *parameters* es una secuencia en lugar de :class:`dict`.

source: date and datetime adapter, date and timestamp converter: see the :mod:`sqlite3` documentation for suggested replacement recipes.
es: Adaptador de fecha y fecha y hora, convertidor de fecha y marca de tiempo: consulte la documentación de :mod:`sqlite3` para obtener recetas de reemplazo sugeridas.

source: :class:`types.CodeType`: Accessing :attr:`~codeobject.co_lnotab` was deprecated in :pep:`626` since 3.10 and was planned to be removed in 3.12, but it only got a proper :exc:`DeprecationWarning` in 3.12. May be removed in 3.14. (Contributed by Nikita Sobolev in :gh:`101866`.)
es: :class:`types.CodeType`: El acceso a :attr:`~codeobject.co_lnotab` quedó obsoleto en :pep:`626` desde la versión 3.10 y se planeó eliminarlo en la versión 3.12, pero recién se agregó un :exc:`DeprecationWarning` adecuado en la versión 3.12. Es posible que se elimine en la versión 3.14. (Contribuido por Nikita Sobolev en :gh:`101866`.)

source: :mod:`typing`: :class:`~typing.ByteString`, deprecated since Python 3.9, now causes a :exc:`DeprecationWarning` to be emitted when it is used.
es: :mod:`typing`: :class:`~typing.ByteString`, obsoleto desde Python 3.9, ahora hace que se emita un :exc:`DeprecationWarning` cuando se utiliza.

source: :mod:`urllib`: :class:`!urllib.parse.Quoter` is deprecated: it was not intended to be a public API. (Contributed by Gregory P. Smith in :gh:`88168`.)
es: :mod:`urllib`: :class:`!urllib.parse.Quoter` está obsoleto: no estaba previsto que fuera una API pública. (Contribuido por Gregory P. Smith en :gh:`88168`.)

source: Pending Removal in Python 3.15
es: Eliminación pendiente en Python 3.15

source: The undocumented :func:`!ctypes.SetPointerType` function has been deprecated since Python 3.13.
es: La función :func:`!ctypes.SetPointerType` no documentada ha quedado obsoleta desde Python 3.13.

source: The obsolete and rarely used :class:`~http.server.CGIHTTPRequestHandler` has been deprecated since Python 3.13. No direct replacement exists. *Anything* is better than CGI to interface a web server with a request handler.
es: El obsoleto y poco utilizado :class:`~http.server.CGIHTTPRequestHandler` ha quedado obsoleto desde Python 3.13. No existe un reemplazo directo. *Anything* es mejor que CGI para interconectar un servidor web con un controlador de solicitudes.

source: The :option:`!--cgi` flag to the :program:`python -m http.server` command-line interface has been deprecated since Python 3.13.
es: La bandera :option:`!--cgi` de la interfaz de línea de comandos :program:`python -m http.server` ha quedado obsoleta desde Python 3.13.

source: :mod:`importlib`: ``__package__`` and ``__cached__`` will cease to be set or taken into consideration by the import system (:gh:`97879`).
es: :mod:`importlib`: ``__package__`` y ``__cached__`` dejarán de configurarse o tomarse en consideración por el sistema de importación (:gh:`97879`).

source: The :func:`~locale.getdefaultlocale` function has been deprecated since Python 3.11. Its removal was originally planned for Python 3.13 (:gh:`90817`), but has been postponed to Python 3.15. Use :func:`~locale.getlocale`, :func:`~locale.setlocale`, and :func:`~locale.getencoding` instead. (Contributed by Hugo van Kemenade in :gh:`111187`.)
es: La función :func:`~locale.getdefaultlocale` ha quedado obsoleta desde Python 3.11. Su eliminación se había planeado originalmente para Python 3.13 (:gh:`90817`), pero se pospuso hasta Python 3.15. Utilice :func:`~locale.getlocale`, :func:`~locale.setlocale` y :func:`~locale.getencoding` en su lugar. (Contribuido por Hugo van Kemenade en :gh:`111187`.)

source: :meth:`.PurePath.is_reserved` has been deprecated since Python 3.13. Use :func:`os.path.isreserved` to detect reserved paths on Windows.
es: :meth:`.PurePath.is_reserved` ha quedado obsoleto desde Python 3.13. Utilice :func:`os.path.isreserved` para detectar rutas reservadas en Windows.

source: :func:`~platform.java_ver` has been deprecated since Python 3.13. This function is only useful for Jython support, has a confusing API, and is largely untested.
es: :func:`~platform.java_ver` ha quedado obsoleto desde Python 3.13. Esta función solo es útil para la compatibilidad con Jython, tiene una API confusa y, en gran medida, no se ha probado.

source: :func:`~threading.RLock` will take no arguments in Python 3.15. Passing any arguments has been deprecated since Python 3.14, as the Python version does not permit any arguments, but the C version allows any number of positional or keyword arguments, ignoring every argument.
es: :func:`~threading.RLock` no acepta argumentos en Python 3.15. El paso de cualquier argumento ha quedado obsoleto desde Python 3.14, ya que la versión de Python no permite ningún argumento, pero la versión de C permite cualquier cantidad de argumentos posicionales o de palabras clave, ignorando todos los argumentos.

source: The undocumented keyword argument syntax for creating :class:`~typing.NamedTuple` classes (e.g. ``Point = NamedTuple("Point", x=int, y=int)``) has been deprecated since Python 3.13. Use the class-based syntax or the functional syntax instead.
es: La sintaxis de argumentos de palabras clave no documentada para crear clases :class:`~typing.NamedTuple` (p. ej., ``Point = NamedTuple("Point", x=int, y=int)``) ha quedado obsoleta desde Python 3.13. En su lugar, utilice la sintaxis basada en clases o la sintaxis funcional.

source: The :func:`typing.no_type_check_decorator` decorator function has been deprecated since Python 3.13. After eight years in the :mod:`typing` module, it has yet to be supported by any major type checker.
es: La función decoradora :func:`typing.no_type_check_decorator` ha quedado obsoleta desde Python 3.13. Después de ocho años en el módulo :mod:`typing`, todavía no ha sido compatible con ningún verificador de tipos importante.

source: The :meth:`~wave.Wave_read.getmark`, :meth:`!setmark`, and :meth:`~wave.Wave_read.getmarkers` methods of the :class:`~wave.Wave_read` and :class:`~wave.Wave_write` classes have been deprecated since Python 3.13.
es: Los métodos :meth:`~wave.Wave_read.getmark`, :meth:`!setmark` y :meth:`~wave.Wave_read.getmarkers` de las clases :class:`~wave.Wave_read` y :class:`~wave.Wave_write` han quedado obsoletos desde Python 3.13.

source: Pending Removal in Python 3.16
es: Eliminación pendiente en Python 3.16

source: Bitwise inversion on boolean types, ``~True`` or ``~False`` has been deprecated since Python 3.12, as it produces surprising and unintuitive results (``-2`` and ``-1``). Use ``not x`` instead for the logical negation of a Boolean. In the rare case that you need the bitwise inversion of the underlying integer, convert to ``int`` explicitly (``~int(x)``).
es: La inversión bit a bit en tipos booleanos, ``~True`` o ``~False``, ha quedado obsoleta desde Python 3.12, ya que produce resultados sorprendentes y poco intuitivos (``-2`` y ``-1``). En su lugar, utilice ``not x`` para la negación lógica de un valor booleano. En el caso poco frecuente de que necesite la inversión bit a bit del entero subyacente, convierta a ``int`` explícitamente (``~int(x)``).

source: The ``'u'`` format code (:c:type:`wchar_t`) has been deprecated in documentation since Python 3.3 and at runtime since Python 3.13. Use the ``'w'`` format code (:c:type:`Py_UCS4`) for Unicode characters instead.
es: El código de formato ``'u'`` (:c:type:`wchar_t`) ha quedado obsoleto en la documentación desde Python 3.3 y en el entorno de ejecución desde Python 3.13. Utilice el código de formato ``'w'`` (:c:type:`Py_UCS4`) para caracteres Unicode.

source: The :class:`!ExecError` exception has been deprecated since Python 3.14. It has not been used by any function in :mod:`!shutil` since Python 3.4, and is now an alias of :exc:`RuntimeError`.
es: La excepción :class:`!ExecError` ha quedado obsoleta desde Python 3.14. No ha sido utilizada por ninguna función en :mod:`!shutil` desde Python 3.4 y ahora es un alias de :exc:`RuntimeError`.

source: The :meth:`Class.get_methods <symtable.Class.get_methods>` method has been deprecated since Python 3.14.
es: El método :meth:`Class.get_methods <symtable.Class.get_methods>` ha quedado obsoleto desde Python 3.14.

source: The :func:`~sys._enablelegacywindowsfsencoding` function has been deprecated since Python 3.13. Use the :envvar:`PYTHONLEGACYWINDOWSFSENCODING` environment variable instead.
es: La función :func:`~sys._enablelegacywindowsfsencoding` ha quedado obsoleta desde Python 3.13. En su lugar, utilice la variable de entorno :envvar:`PYTHONLEGACYWINDOWSFSENCODING`.

source: The undocumented and unused :attr:`!TarFile.tarfile` attribute has been deprecated since Python 3.13.
es: El atributo :attr:`!TarFile.tarfile`, no documentado ni utilizado, ha quedado obsoleto desde Python 3.13.

source: Pending Removal in Future Versions
es: Pendiente de eliminación en futuras versiones

source: The following APIs will be removed in the future, although there is currently no date scheduled for their removal.
es: Las siguientes API se eliminarán en el futuro, aunque actualmente no hay una fecha programada para su eliminación.

source: :mod:`argparse`: Nesting argument groups and nesting mutually exclusive groups are deprecated.
es: :mod:`argparse`: Los grupos de argumentos anidados y los grupos mutuamente excluyentes anidados están obsoletos.

source: :mod:`array`'s ``'u'`` format code (:gh:`57281`)
es: Código de formato :mod:`array` de ``'u'`` (:gh:`57281`)

source: Generators: ``throw(type, exc, tb)`` and ``athrow(type, exc, tb)`` signature is deprecated: use ``throw(exc)`` and ``athrow(exc)`` instead, the single argument signature.
es: Generadores: las firmas ``throw(type, exc, tb)`` y ``athrow(type, exc, tb)`` están obsoletas: utilice ``throw(exc)`` y ``athrow(exc)`` en su lugar, la firma de argumento único.

source: Currently Python accepts numeric literals immediately followed by keywords, for example ``0in x``, ``1or x``, ``0if 1else 2``. It allows confusing and ambiguous expressions like ``[0x1for x in y]`` (which can be interpreted as ``[0x1 for x in y]`` or ``[0x1f or x in y]``). A syntax warning is raised if the numeric literal is immediately followed by one of keywords :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` and :keyword:`or`. In a future release it will be changed to a syntax error. (:gh:`87999`)
es: Actualmente, Python acepta literales numéricos seguidos inmediatamente de palabras clave, por ejemplo, ``0in x``, ``1or x``, ``0if 1else 2``. Permite expresiones confusas y ambiguas como ``[0x1for x in y]`` (que se puede interpretar como ``[0x1 for x in y]`` o ``[0x1f or x in y]``). Se genera una advertencia de sintaxis si el literal numérico va seguido inmediatamente de una de las palabras clave :keyword:`and`, :keyword:`else`, :keyword:`for`, :keyword:`if`, :keyword:`in`, :keyword:`is` y :keyword:`or`. En una versión futura, se cambiará a un error de sintaxis. (:gh:`87999`)

source: Support for ``__index__()`` and ``__int__()`` method returning non-int type: these methods will be required to return an instance of a strict subclass of :class:`int`.
es: Compatibilidad con los métodos ``__index__()`` y ``__int__()`` que devuelven un tipo que no es int: estos métodos serán necesarios para devolver una instancia de una subclase estricta de :class:`int`.

source: Support for ``__float__()`` method returning a strict subclass of :class:`float`: these methods will be required to return an instance of :class:`float`.
es: Compatibilidad con el método ``__float__()`` que devuelve una subclase estricta de :class:`float`: estos métodos serán necesarios para devolver una instancia de :class:`float`.

source: Support for ``__complex__()`` method returning a strict subclass of :class:`complex`: these methods will be required to return an instance of :class:`complex`.
es: Compatibilidad con el método ``__complex__()`` que devuelve una subclase estricta de :class:`complex`: estos métodos serán necesarios para devolver una instancia de :class:`complex`.

source: Delegation of ``int()`` to ``__trunc__()`` method.
es: Delegación del método ``int()`` al ``__trunc__()``.

source: Passing a complex number as the *real* or *imag* argument in the :func:`complex` constructor is now deprecated; it should only be passed as a single positional argument. (Contributed by Serhiy Storchaka in :gh:`109218`.)
es: Ahora está obsoleto el paso de un número complejo como argumento *real* o *imag* en el constructor :func:`complex`; solo debe pasarse como un único argumento posicional. (Contribuido por Serhiy Storchaka en :gh:`109218`.)

source: :mod:`calendar`: ``calendar.January`` and ``calendar.February`` constants are deprecated and replaced by :data:`calendar.JANUARY` and :data:`calendar.FEBRUARY`. (Contributed by Prince Roshan in :gh:`103636`.)
es: :mod:`calendar`: Las constantes ``calendar.January`` y ``calendar.February`` han quedado obsoletas y han sido reemplazadas por :data:`calendar.JANUARY` y :data:`calendar.FEBRUARY`. (Contribuido por Prince Roshan en :gh:`103636`.)

source: :attr:`codeobject.co_lnotab`: use the :meth:`codeobject.co_lines` method instead.
es: :attr:`codeobject.co_lnotab`: utilice el método :meth:`codeobject.co_lines` en su lugar.

source: :meth:`~datetime.datetime.utcnow`: use ``datetime.datetime.now(tz=datetime.UTC)``.
es: :meth:`~datetime.datetime.utcnow`: utilice ``datetime.datetime.now(tz=datetime.UTC)``.

source: :meth:`~datetime.datetime.utcfromtimestamp`: use ``datetime.datetime.fromtimestamp(timestamp, tz=datetime.UTC)``.
es: :meth:`~datetime.datetime.utcfromtimestamp`: utilice ``datetime.datetime.fromtimestamp(timestamp, tz=datetime.UTC)``.

source: :mod:`gettext`: Plural value must be an integer.
es: :mod:`gettext`: El valor plural debe ser un número entero.

source: ``load_module()`` method: use ``exec_module()`` instead.
es: Método ``load_module()``: utilice ``exec_module()`` en su lugar.

source: :func:`~importlib.util.cache_from_source` *debug_override* parameter is deprecated: use the *optimization* parameter instead.
es: :func:`~importlib.util.cache_from_source` El parámetro *debug_override* está obsoleto: utilice el parámetro *optimization* en su lugar.

source: ``EntryPoints`` tuple interface.
es: Interfaz de tupla ``EntryPoints``.

source: Implicit ``None`` on return values.
es: ``None`` implícito en los valores de retorno.

source: :mod:`logging`: the ``warn()`` method has been deprecated since Python 3.3, use :meth:`~logging.warning` instead.
es: :mod:`logging`: el método ``warn()`` ha quedado obsoleto desde Python 3.3, utilice :meth:`~logging.warning` en su lugar.

source: :mod:`mailbox`: Use of StringIO input and text mode is deprecated, use BytesIO and binary mode instead.
es: :mod:`mailbox`: El uso del modo de entrada y texto StringIO está obsoleto; en su lugar, utilice BytesIO y el modo binario.

source: :mod:`os`: Calling :func:`os.register_at_fork` in multi-threaded process.
es: :mod:`os`: Llamada a :func:`os.register_at_fork` en un proceso multiproceso.

source: :class:`!pydoc.ErrorDuringImport`: A tuple value for *exc_info* parameter is deprecated, use an exception instance.
es: :class:`!pydoc.ErrorDuringImport`: Un valor de tupla para el parámetro *exc_info* está obsoleto, utilice una instancia de excepción.

source: :mod:`re`: More strict rules are now applied for numerical group references and group names in regular expressions. Only sequence of ASCII digits is now accepted as a numerical reference. The group name in bytes patterns and replacement strings can now only contain ASCII letters and digits and underscore. (Contributed by Serhiy Storchaka in :gh:`91760`.)
es: :mod:`re`: Ahora se aplican reglas más estrictas para las referencias numéricas de grupos y los nombres de grupos en expresiones regulares. Ahora solo se aceptan secuencias de dígitos ASCII como referencia numérica. El nombre de grupo en patrones de bytes y cadenas de reemplazo ahora solo puede contener letras y dígitos ASCII y guiones bajos. (Contribuido por Serhiy Storchaka en :gh:`91760`.)

source: :mod:`!sre_compile`, :mod:`!sre_constants` and :mod:`!sre_parse` modules.
es: Módulos :mod:`!sre_compile`, :mod:`!sre_constants` y :mod:`!sre_parse`.

source: :mod:`shutil`: :func:`~shutil.rmtree`'s *onerror* parameter is deprecated in Python 3.12; use the *onexc* parameter instead.
es: :mod:`shutil`: El parámetro *onerror* de :func:`~shutil.rmtree` está obsoleto en Python 3.12; utilice el parámetro *onexc* en su lugar.
