Repository: kbiggers/python-docs-es
Catalog: deprecations/index.po
Languages: es

source: :mod:`ssl` options and protocols:
es: Opciones y protocolos :mod:`ssl`:

source: :class:`ssl.SSLContext` without protocol argument is deprecated.
es: :class:`ssl.SSLContext` sin argumento de protocolo está obsoleto.

source: :class:`ssl.SSLContext`: :meth:`~ssl.SSLContext.set_npn_protocols` and :meth:`!selected_npn_protocol` are deprecated: use ALPN instead.
es: :class:`ssl.SSLContext`: :meth:`~ssl.SSLContext.set_npn_protocols` y :meth:`!selected_npn_protocol` están obsoletos: utilice ALPN en su lugar.

source: ``ssl.OP_NO_SSL*`` options
es: Opciones de ``ssl.OP_NO_SSL*``

source: ``ssl.OP_NO_TLS*`` options
es: Opciones de ``ssl.OP_NO_TLS*``

source: :func:`sysconfig.is_python_build` *check_home* parameter is deprecated and ignored.
es: :func:`sysconfig.is_python_build` El parámetro *check_home* está obsoleto y se ignora.

source: :mod:`threading` methods:
es: Métodos :mod:`threading`:

source: :meth:`!threading.Condition.notifyAll`: use :meth:`~threading.Condition.notify_all`.
es: :meth:`!threading.Condition.notifyAll`: utilice :meth:`~threading.Condition.notify_all`.

source: :meth:`!threading.Event.isSet`: use :meth:`~threading.Event.is_set`.
es: :meth:`!threading.Event.isSet`: utilice :meth:`~threading.Event.is_set`.

source: :meth:`!threading.Thread.isDaemon`, :meth:`threading.Thread.setDaemon`: use :attr:`threading.Thread.daemon` attribute.
es: :meth:`!threading.Thread.isDaemon`, :meth:`threading.Thread.setDaemon`: utilice el atributo :attr:`threading.Thread.daemon`.

source: :meth:`!threading.Thread.getName`, :meth:`threading.Thread.setName`: use :attr:`threading.Thread.name` attribute.
es: :meth:`!threading.Thread.getName`, :meth:`threading.Thread.setName`: utilice el atributo :attr:`threading.Thread.name`.

source: :meth:`!threading.currentThread`: use :meth:`threading.current_thread`.
es: :meth:`!threading.currentThread`: utilice :meth:`threading.current_thread`.

source: :meth:`!threading.activeCount`: use :meth:`threading.active_count`.
es: :meth:`!threading.activeCount`: utilice :meth:`threading.active_count`.

source: :class:`unittest.IsolatedAsyncioTestCase`: it is deprecated to return a value that is not ``None`` from a test case.
es: :class:`unittest.IsolatedAsyncioTestCase`: está obsoleto devolver un valor que no sea ``None`` de un caso de prueba.

source: :mod:`urllib.parse` deprecated functions: :func:`~urllib.parse.urlparse` instead
es: Funciones obsoletas de :mod:`urllib.parse`: :func:`~urllib.parse.urlparse` en su lugar

source: :mod:`urllib.request`: :class:`~urllib.request.URLopener` and :class:`~urllib.request.FancyURLopener` style of invoking requests is deprecated. Use newer :func:`~urllib.request.urlopen` functions and methods.
es: :mod:`urllib.request`: el estilo :class:`~urllib.request.URLopener` y :class:`~urllib.request.FancyURLopener` de invocar solicitudes está obsoleto. Utilice las funciones y métodos :func:`~urllib.request.urlopen` más nuevos.

source: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` should not do partial writes.
es: :mod:`wsgiref`: ``SimpleHandler.stdout.write()`` no debería realizar escrituras parciales.

source: :mod:`xml.etree.ElementTree`: Testing the truth value of an :class:`~xml.etree.ElementTree.Element` is deprecated. In a future release it will always return ``True``. Prefer explicit ``len(elem)`` or ``elem is not None`` tests instead.
es: :mod:`xml.etree.ElementTree`: La prueba del valor de verdad de un :class:`~xml.etree.ElementTree.Element` está obsoleta. En una versión futura, siempre devolverá ``True``. En su lugar, es preferible realizar pruebas explícitas ``len(elem)`` o ``elem is not None``.

source: :meth:`zipimport.zipimporter.load_module` is deprecated: use :meth:`~zipimport.zipimporter.exec_module` instead.
es: :meth:`zipimport.zipimporter.load_module` está obsoleto: utilice :meth:`~zipimport.zipimporter.exec_module` en su lugar.

source: C API Deprecations
es: Desuso de la API C

source: The ``ma_version_tag`` field in :c:type:`PyDictObject` for extension modules (:pep:`699`; :gh:`101193`).
es: El campo ``ma_version_tag`` en :c:type:`PyDictObject` para módulos de extensión (:pep:`699`; :gh:`101193`).

source: Creating :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` with mutable bases (:gh:`95388`).
es: Creando :c:data:`immutable types <Py_TPFLAGS_IMMUTABLETYPE>` con bases mutables (:gh:`95388`).

source: Functions to configure Python's initialization, deprecated in Python 3.11:
es: Funciones para configurar la inicialización de Python, obsoletas en Python 3.11:

source: :c:func:`!PySys_SetArgvEx()`: Set :c:member:`PyConfig.argv` instead.
es: :c:func:`!PySys_SetArgvEx()`: Establezca :c:member:`PyConfig.argv` en su lugar.

source: :c:func:`!PySys_SetArgv()`: Set :c:member:`PyConfig.argv` instead.
es: :c:func:`!PySys_SetArgv()`: Establezca :c:member:`PyConfig.argv` en su lugar.

source: :c:func:`!Py_SetProgramName()`: Set :c:member:`PyConfig.program_name` instead.
es: :c:func:`!Py_SetProgramName()`: Establezca :c:member:`PyConfig.program_name` en su lugar.

source: :c:func:`!Py_SetPythonHome()`: Set :c:member:`PyConfig.home` instead.
es: :c:func:`!Py_SetPythonHome()`: Establezca :c:member:`PyConfig.home` en su lugar.

source: The :c:func:`Py_InitializeFromConfig` API should be used with :c:type:`PyConfig` instead.
es: La API :c:func:`Py_InitializeFromConfig` debe utilizarse con :c:type:`PyConfig`.

source: Global configuration variables:
es: Variables de configuración global:

source: :c:var:`Py_DebugFlag`: Use :c:member:`PyConfig.parser_debug` instead.
es: :c:var:`Py_DebugFlag`: Utilice :c:member:`PyConfig.parser_debug` en su lugar.

source: :c:var:`Py_VerboseFlag`: Use :c:member:`PyConfig.verbose` instead.
es: :c:var:`Py_VerboseFlag`: Utilice :c:member:`PyConfig.verbose` en su lugar.

source: :c:var:`Py_QuietFlag`: Use :c:member:`PyConfig.quiet` instead.
es: :c:var:`Py_QuietFlag`: Utilice :c:member:`PyConfig.quiet` en su lugar.

source: :c:var:`Py_InteractiveFlag`: Use :c:member:`PyConfig.interactive` instead.
es: :c:var:`Py_InteractiveFlag`: Utilice :c:member:`PyConfig.interactive` en su lugar.

source: :c:var:`Py_InspectFlag`: Use :c:member:`PyConfig.inspect` instead.
es: :c:var:`Py_InspectFlag`: Utilice :c:member:`PyConfig.inspect` en su lugar.

source: :c:var:`Py_OptimizeFlag`: Use :c:member:`PyConfig.optimization_level` instead.
es: :c:var:`Py_OptimizeFlag`: Utilice :c:member:`PyConfig.optimization_level` en su lugar.

source: :c:var:`Py_NoSiteFlag`: Use :c:member:`PyConfig.site_import` instead.
es: :c:var:`Py_NoSiteFlag`: Utilice :c:member:`PyConfig.site_import` en su lugar.

source: :c:var:`Py_BytesWarningFlag`: Use :c:member:`PyConfig.bytes_warning` instead.
es: :c:var:`Py_BytesWarningFlag`: Utilice :c:member:`PyConfig.bytes_warning` en su lugar.

source: :c:var:`Py_FrozenFlag`: Use :c:member:`PyConfig.pathconfig_warnings` instead.
es: :c:var:`Py_FrozenFlag`: Utilice :c:member:`PyConfig.pathconfig_warnings` en su lugar.

source: :c:var:`Py_IgnoreEnvironmentFlag`: Use :c:member:`PyConfig.use_environment` instead.
es: :c:var:`Py_IgnoreEnvironmentFlag`: Utilice :c:member:`PyConfig.use_environment` en su lugar.

source: :c:var:`Py_DontWriteBytecodeFlag`: Use :c:member:`PyConfig.write_bytecode` instead.
es: :c:var:`Py_DontWriteBytecodeFlag`: Utilice :c:member:`PyConfig.write_bytecode` en su lugar.

source: :c:var:`Py_NoUserSiteDirectory`: Use :c:member:`PyConfig.user_site_directory` instead.
es: :c:var:`Py_NoUserSiteDirectory`: Utilice :c:member:`PyConfig.user_site_directory` en su lugar.

source: :c:var:`Py_UnbufferedStdioFlag`: Use :c:member:`PyConfig.buffered_stdio` instead.
es: :c:var:`Py_UnbufferedStdioFlag`: Utilice :c:member:`PyConfig.buffered_stdio` en su lugar.

source: :c:var:`Py_HashRandomizationFlag`: Use :c:member:`PyConfig.use_hash_seed` and :c:member:`PyConfig.hash_seed` instead.
es: :c:var:`Py_HashRandomizationFlag`: Utilice :c:member:`PyConfig.use_hash_seed` y :c:member:`PyConfig.hash_seed` en su lugar.

source: :c:var:`Py_IsolatedFlag`: Use :c:member:`PyConfig.isolated` instead.
es: :c:var:`Py_IsolatedFlag`: Utilice :c:member:`PyConfig.isolated` en su lugar.

source: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Use :c:member:`PyPreConfig.legacy_windows_fs_encoding` instead.
es: :c:var:`Py_LegacyWindowsFSEncodingFlag`: Utilice :c:member:`PyPreConfig.legacy_windows_fs_encoding` en su lugar.

source: :c:var:`Py_LegacyWindowsStdioFlag`: Use :c:member:`PyConfig.legacy_windows_stdio` instead.
es: :c:var:`Py_LegacyWindowsStdioFlag`: Utilice :c:member:`PyConfig.legacy_windows_stdio` en su lugar.

source: :c:var:`!Py_FileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` instead.
es: :c:var:`!Py_FileSystemDefaultEncoding`: Utilice :c:member:`PyConfig.filesystem_encoding` en su lugar.

source: :c:var:`!Py_HasFileSystemDefaultEncoding`: Use :c:member:`PyConfig.filesystem_encoding` instead.
es: :c:var:`!Py_HasFileSystemDefaultEncoding`: Utilice :c:member:`PyConfig.filesystem_encoding` en su lugar.

source: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Use :c:member:`PyConfig.filesystem_errors` instead.
es: :c:var:`!Py_FileSystemDefaultEncodeErrors`: Utilice :c:member:`PyConfig.filesystem_errors` en su lugar.

source: :c:var:`!Py_UTF8Mode`: Use :c:member:`PyPreConfig.utf8_mode` instead. (see :c:func:`Py_PreInitialize`)
es: :c:var:`!Py_UTF8Mode`: Utilice :c:member:`PyPreConfig.utf8_mode` en su lugar. (ver :c:func:`Py_PreInitialize`)

source: The bundled copy of ``libmpdecimal``.
es: La copia incluida de ``libmpdecimal``.

source: The :c:func:`PyImport_ImportModuleNoBlock`: Use :c:func:`PyImport_ImportModule` instead.
es: :c:func:`PyImport_ImportModuleNoBlock`: utilice :c:func:`PyImport_ImportModule` en su lugar.

source: :c:func:`PyWeakref_GetObject` and :c:func:`PyWeakref_GET_OBJECT`: Use :c:func:`PyWeakref_GetRef` instead.
es: :c:func:`PyWeakref_GetObject` y :c:func:`PyWeakref_GET_OBJECT`: utilice :c:func:`PyWeakref_GetRef` en su lugar.

source: :c:type:`Py_UNICODE` type and the :c:macro:`!Py_UNICODE_WIDE` macro: Use :c:type:`wchar_t` instead.
es: Tipo :c:type:`Py_UNICODE` y macro :c:macro:`!Py_UNICODE_WIDE`: utilice :c:type:`wchar_t` en su lugar.

source: Python initialization functions:
es: Funciones de inicialización de Python:

source: :c:func:`PySys_ResetWarnOptions`: Clear :data:`sys.warnoptions` and :data:`!warnings.filters` instead.
es: :c:func:`PySys_ResetWarnOptions`: borre :data:`sys.warnoptions` y :data:`!warnings.filters` en su lugar.

source: :c:func:`Py_GetExecPrefix`: Get :data:`sys.exec_prefix` instead.
es: :c:func:`Py_GetExecPrefix`: Obtenga :data:`sys.exec_prefix` en su lugar.

source: :c:func:`Py_GetPath`: Get :data:`sys.path` instead.
es: :c:func:`Py_GetPath`: Obtenga :data:`sys.path` en su lugar.

source: :c:func:`Py_GetPrefix`: Get :data:`sys.prefix` instead.
es: :c:func:`Py_GetPrefix`: Obtenga :data:`sys.prefix` en su lugar.

source: :c:func:`Py_GetProgramFullPath`: Get :data:`sys.executable` instead.
es: :c:func:`Py_GetProgramFullPath`: Obtenga :data:`sys.executable` en su lugar.

source: :c:func:`Py_GetProgramName`: Get :data:`sys.executable` instead.
es: :c:func:`Py_GetProgramName`: Obtenga :data:`sys.executable` en su lugar.

source: :c:func:`Py_GetPythonHome`: Get :c:member:`PyConfig.home` or the :envvar:`PYTHONHOME` environment variable instead.
es: :c:func:`Py_GetPythonHome`: Obtenga la variable de entorno :c:member:`PyConfig.home` o :envvar:`PYTHONHOME` en su lugar.

source: The following APIs are deprecated and will be removed, although there is currently no date scheduled for their removal.
es: Las siguientes API están obsoletas y se eliminarán, aunque actualmente no hay una fecha programada para su eliminación.

source: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: Unneeded since Python 3.8.
es: :c:macro:`Py_TPFLAGS_HAVE_FINALIZE`: Innecesario desde Python 3.8.

source: :c:func:`PyErr_Fetch`: Use :c:func:`PyErr_GetRaisedException` instead.
es: :c:func:`PyErr_Fetch`: Utilice :c:func:`PyErr_GetRaisedException` en su lugar.

source: :c:func:`PyErr_NormalizeException`: Use :c:func:`PyErr_GetRaisedException` instead.
es: :c:func:`PyErr_NormalizeException`: Utilice :c:func:`PyErr_GetRaisedException` en su lugar.

source: :c:func:`PyErr_Restore`: Use :c:func:`PyErr_SetRaisedException` instead.
es: :c:func:`PyErr_Restore`: Utilice :c:func:`PyErr_SetRaisedException` en su lugar.

source: :c:func:`PyModule_GetFilename`: Use :c:func:`PyModule_GetFilenameObject` instead.
es: :c:func:`PyModule_GetFilename`: Utilice :c:func:`PyModule_GetFilenameObject` en su lugar.

source: :c:func:`PyOS_AfterFork`: Use :c:func:`PyOS_AfterFork_Child` instead.
es: :c:func:`PyOS_AfterFork`: Utilice :c:func:`PyOS_AfterFork_Child` en su lugar.

source: :c:func:`PySlice_GetIndicesEx`: Use :c:func:`PySlice_Unpack` and :c:func:`PySlice_AdjustIndices` instead.
es: :c:func:`PySlice_GetIndicesEx`: Utilice :c:func:`PySlice_Unpack` y :c:func:`PySlice_AdjustIndices` en su lugar.

source: :c:func:`!PyUnicode_AsDecodedObject`: Use :c:func:`PyCodec_Decode` instead.
es: :c:func:`!PyUnicode_AsDecodedObject`: Utilice :c:func:`PyCodec_Decode` en su lugar.

source: :c:func:`!PyUnicode_AsDecodedUnicode`: Use :c:func:`PyCodec_Decode` instead.
es: :c:func:`!PyUnicode_AsDecodedUnicode`: Utilice :c:func:`PyCodec_Decode` en su lugar.

source: :c:func:`!PyUnicode_AsEncodedObject`: Use :c:func:`PyCodec_Encode` instead.
es: :c:func:`!PyUnicode_AsEncodedObject`: Utilice :c:func:`PyCodec_Encode` en su lugar.

source: :c:func:`!PyUnicode_AsEncodedUnicode`: Use :c:func:`PyCodec_Encode` instead.
es: :c:func:`!PyUnicode_AsEncodedUnicode`: Utilice :c:func:`PyCodec_Encode` en su lugar.

source: :c:func:`PyUnicode_READY`: Unneeded since Python 3.12
es: :c:func:`PyUnicode_READY`: Innecesario desde Python 3.12

source: :c:func:`!PyErr_Display`: Use :c:func:`PyErr_DisplayException` instead.
es: :c:func:`!PyErr_Display`: Utilice :c:func:`PyErr_DisplayException` en su lugar.

source: :c:func:`!_PyErr_ChainExceptions`: Use :c:func:`!_PyErr_ChainExceptions1` instead.
es: :c:func:`!_PyErr_ChainExceptions`: Utilice :c:func:`!_PyErr_ChainExceptions1` en su lugar.

source: :c:member:`!PyBytesObject.ob_shash` member: call :c:func:`PyObject_Hash` instead.
es: Miembro de :c:member:`!PyBytesObject.ob_shash`: llame a :c:func:`PyObject_Hash` en su lugar.

source: :c:member:`!PyDictObject.ma_version_tag` member.
es: Miembro de :c:member:`!PyDictObject.ma_version_tag`.

source: Thread Local Storage (TLS) API:
es: API de almacenamiento local de subprocesos (TLS):

source: :c:func:`PyThread_create_key`: Use :c:func:`PyThread_tss_alloc` instead.
es: :c:func:`PyThread_create_key`: Utilice :c:func:`PyThread_tss_alloc` en su lugar.

source: :c:func:`PyThread_delete_key`: Use :c:func:`PyThread_tss_free` instead.
es: :c:func:`PyThread_delete_key`: Utilice :c:func:`PyThread_tss_free` en su lugar.

source: :c:func:`PyThread_set_key_value`: Use :c:func:`PyThread_tss_set` instead.
es: :c:func:`PyThread_set_key_value`: Utilice :c:func:`PyThread_tss_set` en su lugar.

source: :c:func:`PyThread_get_key_value`: Use :c:func:`PyThread_tss_get` instead.
es: :c:func:`PyThread_get_key_value`: Utilice :c:func:`PyThread_tss_get` en su lugar.

source: :c:func:`PyThread_delete_key_value`: Use :c:func:`PyThread_tss_delete` instead.
es: :c:func:`PyThread_delete_key_value`: Utilice :c:func:`PyThread_tss_delete` en su lugar.

source: :c:func:`PyThread_ReInitTLS`: Unneeded since Python 3.7.
es: :c:func:`PyThread_ReInitTLS`: Innecesario desde Python 3.7.
